In [1]:
import pandas as pd
import numpy as np

In [4]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')
date.head()

   Unnamed: 0        date  product_id  city_id  orders
0           0  2019-12-10        5628       25       3
1           1  2018-08-15        3646       14     157
2           2  2018-10-23        1859       25       1
3           3  2019-08-17        7292       25       1
4           4  2019-01-06        4344       25       3

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1000 non-null   int64
 1   date        1000 non-null   object
 2   product_id  1000 non-null   int64
 3   city_id     1000 non-null   int64
 4   orders      1000 non-null   int64
dtypes: int64(4), object(1)
memory usage: 39.2+ KB

In [13]:
date.drop(columns=['Unnamed: 0'], inplace=True)

#### Here we can see `date` is the object type variable. Its need to convert into date format

In [14]:
date.head(1)

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3

In [15]:
date['date'] = pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

### Extract Year

In [16]:
date['date_year'] = date['date'].dt.year
date.head(1)

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019

In [19]:
date['month'] = date['date'].dt.month
date.head(1)

        date  product_id  city_id  orders  date_year  month
0 2019-12-10        5628       25       3       2019     12

In [20]:
date['month_name'] = date['date'].dt.month_name()
date.head(1)

        date  product_id  city_id  orders  date_year  month month_name
0 2019-12-10        5628       25       3       2019     12   December

### Extract Day

In [21]:
date['date_day'] = date['date'].dt.day
date.head(1)

,date,product_id,city_id,orders,date_year,month,month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10

In [22]:
## day of week
date['date_day_of_week'] = date['date'].dt.dayofweek
date.head(1)

,date,product_id,city_id,orders,date_year,month,month_name,date_day,date_day_of_week
0,2019-12-10,5628,25,3,2019,12,December,10,1

In [24]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,month,month_name,date_day,date_day_of_week,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [25]:
# is weekend?
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,month,month_name,date_day,date_day_of_week,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

In [26]:
date['date_week'] = date['date'].dt.week

date.drop(columns=['product_id','city_id','orders']).head()

AttributeError: 'DatetimeProperties' object has no attribute 'week'